'''1) Задайте значение переменной через функцию input. Запустите скрипт 
и введите в консоль ваш возраст. Выведите на экран сообщение 
в формате «Ваш возраст: my_age». 2) Сохраните в переменную my_age
 эту же переменную + 1.'''

# 1 часть:
my_age = int(input("Сколько Вам лет? Введите целое число: "))
print("Ваш возраст: ", my_age)
# 2 часть:
my_age = my_age + 1
